/* ====================================================================== */
/* Auth Dialog */

/* ---------------------------------------------------------------------- */
/* Window Titles */
"ENTER_CREDENTIALS" = "Introduzir credenciais";
"CONNECT_TO_SERVER" = "Ligar ao servidor";
"PRINTER_AUTH" = "Autenticação da impressora";
"SCREEN_SHARE_AUTH" = "Partilhar ecrã";

/* ---------------------------------------------------------------------- */
/* Auth Dialog Messages */

/* Generic Connect */
"GENERIC_MSG_BOTH" = "Digite o seu nome e palavra-passe para ligar a “%@”.";
"GENERIC_MSG_PASS" = "Digite a sua palavra-passe para ligar a “%@”.";
"GENERIC_MSG_NONAME" = "Digite o seu nome de utilizador e a palavra-passe.";

/* Protocol Specific */
"AFP_MSG" = "Digite o seu nome e palavra-passe para o servidor “%@”.";
"SMB_MSG" = "Digite o seu nome e palavra-passe para o servidor “%@”.";
"FTP_MSG" = "Digite o seu nome e palavra-passe para o servidor “%@”.";
"WEBDAV_MSG" = "Digite o seu nome e palavra-passe para o servidor “%@”.";

/* File Server */
"FS_MSG_BOTH" = "Digite o seu nome e palavra-passe para o servidor “%@”.";
"FS_MSG_PASS" = "Digite a sua palavra-passe para o servidor “%@”.";

/* Generic Server */
"SRV_MSG_BOTH" = "Digite o seu nome e palavra-passe para o servidor “%@”.";
"SRV_MSG_PASS" = "Digite a sua palavra-passe para o servidor “%@”.";

/* Printer */
"PRINT_MSG_BOTH" = "Digite o seu nome e palavra-passe para a impressora “%@”.";
"PRINT_MSG_PASS" = "Digite a sua palavra-passe para a impressora “%@”.";

/* Print Server */
"PS_MSG_BOTH" = "Digite o seu nome de utilizador e palavra-passe para o servidor de impressão “%@”.";
"PS_MSG_PASS" = "Digite o seu nome de utilizador e palavra-passe para o servidor de impressão “%@”.";

/* Screen Sharing */
"SS_MSG_BOTH" = "Digite o seu nome e palavra-passe para partilhar o ecrã de “%@”.";
"SS_MSG_PASS" = "Digite a sua palavra-passe para partilhar o ecrã de “%@”.";

"VS_MSG_BOTH" = "Digite o seu nome e palavra-passe para visualizar o ecrã de “%@”.";
"VS_MSG_PASS" = "Digite a sua palavra-passe para visualizar o ecrã de “%@”.";

/* Time Machine */
"TM_MSG_BOTH" = "Digite o seu nome e palavra-passe para o servidor “%@” para que possa ser acedido pelo Time Machine.";
"TM_MSG_PASS" = "Digite a sua palavra-passe para o servidor “%@” para que possa ser acedido pelo Time Machine.";

/* Pre Auth */
"PA_MSG_BOTH" = "Digite o seu nome e palavra-passe para o servidor proxy “%@”.";
"PA_MSG_PASS" = "Digite a sua palavra-passe para o servidor proxy “%@”.";


/* ---------------------------------------------------------------------- */
/* Auth Dialog Buttons */
"CONNECT" = "Ligar";
"SHARE" = "Partilhar";
"PRINT" = "Imprimir";
"VIEW" = "Visualizar";
"OK" = "OK";

"CONNECT_AS" = "Ligar como:";
"GUEST" = "Convidado";
"REGISTERED_USER" = "Utilizador registado";

"CONNECT_BY" = "Ligar:";
"BY_ASKING_FOR_PERMISSION" = "Solicitando permissão";
"AS_REGISTERED_USER" = "Como utilizador registado";


/* ---------------------------------------------------------------------- */
/* Tool Tips */
"TOOLTIP_NAME_SMB" = "Domínio\\Nome de utilizador";

/* ====================================================================== */
/* Share Picker Messages */
"SELECT_VOLUME_ON_SERVER" = "Seleccione os volumes que pretende montar em “%@”:";
"SELECT_VOLUME" = "Seleccione os volumes a montar:";

"SELECT_PRINTER_ON_SERVER" = "Seleccione a impressora em “%@”:";

/* ---------------------------------------------------------------------- */
/* default western encoding name */
"WESTERN_MAC" = "Ocidental (Mac)";


/* ====================================================================== */
/* Change Password */
"CHANGE_PASSWORD_MSG" = "Altere a palavra-passe para “%1$@” em “%2$@”.";


/* ====================================================================== */
/* Progress Dialog */
"CONNECTING_TO_GENERIC" = "A ligar…";
"CONNECTING_TO_HOST" = "A ligar a “%@”.";


/* ====================================================================== */
/* Volume Password */
"ENTER_VOLUME_PASSWORD_FOR_SERVER" = "Digite a palavra-passe de “%@”, no servidor de ficheiros “%@”.";
"ENTER_VOLUME_PASSWORD" = "Digite a palavra-passe de “%@”.";


/* ====================================================================== */
/* Keychain Kinds */
"NETWORK_PASSWORD" = "Palavra-passe da rede";
"PRINT_PASSWORD" = "Palavra-passe da impressora";
"AFP_PASSWORD" = "Palavra-passe AFP";
"SMB_PASSWORD" = "Palavra-passe SMB";
"FTP_PASSWORD" = "Palavra-passe FTP";
"WEBDAV_PASSWORD" = "Palavra-passe WebDAV";
"VNC_PASSWORD" = "Palavra-passe VNC";


/* ====================================================================== */
/* ---------------------------------------------------------------------- */
/* Error Message Text */
"EMSG_OCCURRED" = "Ocorreu um erro.";
"EMSG_INVALID_PWD" = "Palavra-passe inválida.";
"EMSG_INVALID_NAME_PWD" = "Digitou um nome de utilizador ou palavra-passe inválidos.";
"EMSG_PWD_EXPIRED" = "A palavra-passe expirou.";
"EMSG_PWD_NEEDS_CHANGE" = "A sua palavra-passe tem de ser alterada.";
"EMSG_PWD_POLICY" = "A palavra-passe não cumpre a política imposta pelo servidor.";
"EMSG_CONNECTION_FAILED" = "A ligação falhou";

"EMSG_MOUNT_FAILURE" = "Falha ao montar um volume.";

/* ---------------------------------------------------------------------- */
/* Error Info Text */
"EINFO_TRY_AGAIN" = "Tente de novo.";
"EINFO_CONTACT_ADMIN" = "Para mais informações, contacte o administrador do sistema.";

"EINFO_NO_ACCESS_USER" = "Não tem permissão para aceder ao servidor “%@”.";
"EINFO_NO_ACCESS_GUEST" = "O servidor “%@” não permite o acesso como Convidado.";
"EINFO_SAME_MACHINE" = "O servidor “%@” está disponível no seu computador. Aceda localmente aos volumes e ficheiros.";
"EINFO_NO_SERVER" = "O servidor “%@” poderá não existir ou estar indisponível. Verifique o nome do servidor ou o endereço IP e a sua ligação de rede, e tente de novo.";
"EINFO_TOO_MANY_USERS" = "O servidor “%@” não permite que mais utilizadores iniciem sessão. Tente de novo mais tarde.";
"EINFO_GENERAL" = "Ocorreu um erro ao ligar ao servidor “%@”. Verifique o nome do servidor ou o endereço IP e tente de novo.\n\nSe não conseguir resolver o problema, contacte o administrador do sistema.";
"EINFO_NO_SHARES" = "Não há partilhas disponíveis ou não tem permissão para aceder a elas no servidor “%@”. Contacte o administrador do sistema para resolver o problema.";

"EINFO_NO_ACCESS_USER_UNKNOWN" = "Não tem permissão para aceder a este servidor.";
"EINFO_NO_ACCESS_GUEST_UNKNOWN" = "Este servidor não permite o acesso como Convidado.";
"EINFO_SAME_MACHINE_UNKNOWN" = "Este servidor de ficheiros está disponível no seu computador. Aceda localmente aos volumes e ficheiros.";
"EINFO_NO_SERVER_UNKNOWN" = "O servidor poderá não existir ou estar indisponível. Verifique o nome do servidor ou o endereço IP e a sua ligação de rede, e tente de novo.";
"EINFO_TOO_MANY_USERS_UNKNOWN" = "Este servidor de ficheiros não permite que mais utilizadores iniciem sessão. Tente de novo mais tarde.";
"EINFO_GENERAL_UNKNOWN" = "Ocorreu um erro ao ligar ao servidor. Verifique o nome do servidor ou o endereço IP e tente de novo.\n\nSe não conseguir resolver o problema, contacte o seu administrador do sistema.";
"EINFO_NO_SHARES_UNKNOWN" = "Não há partilhas disponíveis ou não tem permissão para aceder a elas no servidor. Contacte o administrador do sistema para resolver o problema.";

"EINFO_UNKNOWN_MOUNT_FAILED" = "Ocorreu um erro ao montar um volume.";
"EINFO_ONE_MOUNT_FAILED" = "Não foi possível montar o volume “%@”.";
"EINFO_MULTIPLE_MOUNTS_FAILED" = "Não foi possível montar os volumes seguintes:";
